Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྲེད་པའི་རླན་བསྐམ་པ་ལ་མངོན་པར་བརྩོན་པའོ། །
en: He is dedicated to drying up the moisture of craving in all beings.

source: ལྟ་བའི་རྣམ་པ་དང་དྲ་བ་ཐམས་ཅད་གཏུབ་པ་ལ་བརྩོན་པའོ། །
en: He is dedicated to cutting through the nets of wrong views.

source: ཉོན་མོངས་པའི་ལྕག་ལྕིག་ཐམས་ཅད་ཟད་པར་བསྲེག་པ་ལ་སྟ་གོན་དུ་གནས་པའོ། །
en: He is prepared to incinerate the forest of kleśas.

source: མི་ཁོམ་མི་ཤེས་པའི་བས་མཐའི་དགོན་པ་ཐམས་ཅད་སྣང་བར་བྱ་བ་ལ་བརྩོན་པའོ། །
en: He is dedicated to illuminating all the desolate areas of unfavorable knowledge.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒ་ཤིའི་གཡང་ས་དང་། འཇིགས་པ་རྣམ་པར་བཟློག་པ་ལ་ཡི་དམ་བརྟན་པའོ། །
en: He has the resolute commitment to turn all beings away from the terror of the chasm of aging and death.

source: དུས་གསུམ་གྱི་མུན་པ་བསལ་བ་ལ་མངོན་པར་བརྩོན་པའོ། །
en: He is dedicated to dispelling the darkness in the three times.

source: ཆོས་ཐམས་ཅད་ཀྱི་འོད་གཟེར་དགྱེ་བ་ལ་ཞུགས་པའོ། །
en: He radiates the light rays of the entire Dharma.

source: རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། ཚངས་པ་ཇི་སྙེད་ཅིག་མཁན་པོ་དང་དབང་བསྒྱུར་བ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་གཙོ་བོར་རང་རང་རློམ་ཞིང་སེམས་པ། ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་པ། དེ་དག་ཐམས་ཅད་འཕགས་པ་འདིའི་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་ཀྱི་ཐུགས་དམ་གྱི་མཐུས་རང་རང་གི་གནས་ན་བག་དགའ་བ་མེད་ཅིང་། དེ་དག་བསམ་གཏན་གྱི་རོ་དགའ་བ་མྱོང་བ་མེད་པས། འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །དེ་དག་ཕྱིན་པ་དང་།
en: “Noble one, while this ārya was enduring the ascetic practice of the five heats, through the power of his commitment to asceticism and self-discipline, Brahmās who were accomplished and powerful, who arrogantly thought of themselves as preeminent in all worlds, and who were attached to a variety of incorrect views ceased to take pleasure in their state and no longer enjoyed the taste of their dhyāna, and they came into the presence of this ārya.

source: འཕགས་པ་འདིའི་རྫུ་འཕྲུལ་གྱི་སྦྱིན་པ་དང་། དྲག་ཤུལ་གྱི་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་ཀྱི་ཟིལ་གྱིས་མནན་ཏེ། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། ང་རྒྱལ་དང་རློམ་སེམས་ཐམས་ཅད་རབ་ཏུ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །འགྲོ་བ་ཐམས་ཅད་ལ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོས་ཁྱབ་པར་བྱ་བ་དང་།
en: When they had arrived, through the overpowering might of this ārya’s miracles and his fierce discipline and asceticism, they were all turned away from their wrong views, and he taught them the Dharma so that they would abandon all their pride and arrogance.

source: བྱང་ཆུབ་ཀྱི་བསམ་པ་བརྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཤིན་ཏུ་ཡངས་པར་བྱ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཡང་དག་པར་བལྟ་བ་ལ་མངོན་པར་བརྩོན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་གསུང་གི་དཀྱིལ་འཁོར་ཐོབ་པར་བྱ་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཐམས་ཅད་དུ་གྲགས་པའི་སངས་རྒྱས་ཀྱི་དབྱངས་ལ་ཐོགས་པ་མེད་ཅིང་བསྒྲིབ་པ་མེད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: He taught them the Dharma so that they would have great love and great compassion that spread over all beings, so that they would have an unwavering wish for enlightenment, so that they would develop a vast aspiration for enlightenment, so that they would be dedicated to seeing all the buddhas, so that they would have the complete attainment of the domain of the speech of the buddhas, and so that there would be everywhere without obscuration or impediment the sound of the voices of the buddhas.”

source: བདུད་སྟོང་ཕྲག་བཅུ་ཡང་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས། ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེས་མངོན་པར་གཏོར་ཏེ།
en: Ten thousand māras were also in the sky above, scattering divine precious jewels.

source: འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། འོད་འཕྲོ་བའི་ཕུང་པོ་འདི་ལས་སྣང་བ་ཆེན་པོ་བྱུང་ཞིང་ཁོ་བོ་ཅག་གི་ཁྱིམ་དང་། ལུས་དང་རྒྱན་གྱི་ལོངས་སྤྱོད་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ། །
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats, from this mass of light rays came a great radiance that outshone all our residences, bodies, adornments, and possessions.

source: དེའི་ཕྱིར་ཁོ་བོ་ཅག་ཀྱང་སོ་སོའི་གནས་གནས་ན་བག་དགའ་བ་མེད་པས་འཁོར་དང་བཅས་ཏེ་འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །ཁོ་བོ་ཅག་འདིའི་དྲུང་དུ་ཕྱིན་ནས་ཀྱང་། འཕགས་པ་འདི་ནི་ཁོ་བོ་ཅག་ལ་ཅི་ནས་ཀྱང་རང་རང་གི་སེམས་སོར་ཆུད་ནས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Therefore, we too ceased to take pleasure in our residences, and with our entourages we came into the presence of this ārya.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: When we had come before him, this ārya taught us the Dharma so that our minds were healed, we developed the aspiration for enlightenment, and we became irreversible on the way to the highest, complete enlightenment.”

source: དབང་བསྒྱུར་གྱི་ལྷའི་རྒྱལ་པོ། སྟོང་ཕྲག་བཅུས་ཀྱང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་གིས་མངོན་པར་གཏོར་ཏེ། འདི་སྐད་ཅེས་འཛེར་ཏོ། །
en: Ten thousand Vaśavartin deva kings were also in the sky above, scattering divine flowers.

source: རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་བྱེད་པའི་ཚེ། ཁོ་བོ་ཅག་ཀྱང་རང་རང་གི་གནས་ན་དགའ་བ་མེད་དེ། དེ་ལྟར་བདག་ཅག་ཀྱང་རང་རང་གི་སྐྱེ་བོའི་འཁོར་དང་བཅས་ཏེ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats, we also ceased to take delight in our residences, and therefore each of us, without entourages, came into the presence of this ārya.

source: བདག་ཅག་འདིའི་དྲུང་དུ་ཕྱིན་པ་དང་འདི་ནི་བདག་ཅག་ལ་རང་རང་གི་སེམས་ལ་དབང་བསྒྱུར་བ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །ཉོན་མོངས་པ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བ་ཐོབ་པར་བྱ་བ་དང་།
en: When we came into his presence, he taught us the Dharma so that we gained control over our own minds.

source: བསམ་པ་ཇི་ལྟ་བཞིན་དུ་སྐྱེ་བ་ལ་དབང་བསྒྱུར་བ་ཐོབ་པར་བྱ་བ་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་དབང་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་དབང་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། ཡོ་བྱད་ལ་དབང་བའི་རྒྱན་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚེ་ལ་དབང་བསྒྱུར་བ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: He taught us the Dharma so that we would have power over all kleśas, so that we would have the power to be reborn wherever we wish, so that we would have the power to purify the obscuration of karma, so that we would have power over all meditative states, so that we would have power over requisites, and so that we would have the power to live as long as we wish.”

source: རབ་འཕྲུལ་དགའི་ལྷའི་རྒྱལ་པོ་སྟོང་ཕྲག་བཅུ་ཡང་སྟེང་གི་བར་སྣང་ལ་འཁོད་དེ། ལྷ་རྫས་ཀྱི་གླུ་ཡང་དག་པར་སྦྱར་བའི་ང་རོ་སྙན་པའི་དབྱངས་བསྒྲགས་ཏེ།
en: Ten thousand Sunirmita deva kings were also in the sky above, singing out a melodious roar of divine songs.

source: མཆོད་པ་བྱས་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་འདི་ལས་དེ་དང་འདྲ་བའི་འོད་བྱུང་ཞིང་དེས་ཁོ་བོ་ཅག་གི་གཞལ་མེད་ཁང་འདི་དག་རྣམ་པར་དག་སྟེ། གསལ་བ་དང་འོད་ཤིན་ཏུ་དང་བར་གྱུར་ཏོ། །
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats there came from those masses of flames a corresponding light that purified, illuminated, and brightened our aerial palaces.

source: རྒྱན་འདི་དང་ལྷའི་བུ་མོ་འདི་དག་ཀྱང་རྣམ་པར་དག་ཅིང་གསལ་ལ་འོད་ཤིན་དུ་དང་བར་གྱུར་ཏོ། །
en: It also illuminated and brightened our adornments and our apsarases.

source: དེ་བས་ན་བདག་ཅག་ཀྱང་ལྷའི་བུ་དང་ལྷ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པར་འདོད་པ་ལ་དགའ་བར་ཚོར་བ་མེད་དོ། །
en: Then we ceased to take delight in our entourage of young devas and apsarases.

source: འདོད་པའི་བདེ་བ་ལ་མངོན་པར་དགའ་བ་མེད་པས་ལུས་དང་སེམས་ཚིམ་པར་གྱུར་ནས།
en: We ceased to delight in the bliss of desire, and our bodies and minds were left unsatisfied.

source: འཕགས་པ་འདིའི་དྲུང་དུ་དོང་བ་ཡིན་ཏེ།
en: We came into the presence of this ārya.

source: འཕགས་པ་འདི་ནི་བདག་ཅག་དེ་ལྟར་ཕྱིན་པ་རྣམས་ལ་སེམས་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །སེམས་ཀྱི་འོད་འདང་བར་བྱ་བ་དང་། སེམས་ཤིན་དུ་དག་པར་བྱ་བ་དང་། སེམས་ལས་སུ་རུང་བར་བྱ་བ་དང་།
en: When we came into his presence, he taught us the Dharma so that our minds would be purified.

source: སེམས་ཀྱི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། སྟོབས་བཅུའི་ཡེ་ཤེས་འཐོབ་པ་རྣམ་པར་དག་པར་བྱ་བ་དང་། ཆོས་ཀྱི་ཤུགས་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་སྐུ་ཚད་མེད་པ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར་ལུས་རྣམ་པར་དག་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་ཐོབ་པར་བྱ་བའི་ཕྱིར་ངག་རྣམ་པར་དག་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་རབ་ཏུ་ཐོབ་པར་བྱ་བར་སེམས་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: He taught us the Dharma so that our minds would be brightened, so that our minds would be very pure, so that our minds would be tractable, so that our minds would be joyful, so that we would have the pure attainment of the knowledge of the ten strengths, so as to increase the great power of the Dharma, so as to purify our bodies, so as to attain an immeasurable buddha body, so as to purify our speech, and so as to attain the voice of a buddha.”

source: རབ་དགའ་ལྡན་གྱི་ལྷའི་རྒྱལ་པོ་སྟོང་ཕྲག་བཅུའི་ལྷའི་བུ་དང་། ལྷའི་བུ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དག་ཀྱང་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས། སྤོས་སྣ་ཚོགས་ཀྱི་ཕྱེ་མའི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་པས་མཆོད་པ་བྱས་ཏེ། ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །
en: Ten thousand Saṃtuṣita deva kings were also in the sky with an entourage of deva youths and apsarases, all of whom were paying homage and making an offering of sending down rain from clouds of various scented powders.

source: རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། བདག་ཅག་ཀྱང་རང་རང་གི་གནས་ན་དགའ་བ་མེད་དེ།
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats, we ceased to take delight in our residences.

source: དེ་ལྟར་དགའ་བ་མེད་པས་འདིའི་དྲུང་དུ་འདོང་སྟེ།
en: As we had ceased to take delight in them, we came into the presence of this ārya.

source: བདག་ཅག་ཕྱིན་པ་རྣམས་ལ་འཕགས་པ་འདི་ནི་ཡུལ་ཐམས་ཅད་ལ་ལྟོས་པ་མེད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །ཆོག་ཤེས་པའི་སེམས་སུ་བྱ་བ་དང་།
en: When we came into his presence, he taught us the Dharma so that we would not be dependent on any sensory object.

source: དགེ་བའི་རྩ་བ་ཡང་དག་པར་བསྐྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: He taught us the Dharma so that our minds would have contentment, so that we would create the roots of merit, so that we would attain the development of the aspiration for enlightenment, and so that we would be able to fulfill the entire Buddhadharma.”

source: རབ་མཚེ་མའི་ལྷའི་རྒྱལ་པོ་སྟོང་ཕྲག་བཅུ་ལྷའི་བུ་དང་། ལྷའི་བུ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དག་གིས་ཀྱང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་མན་ད་ར་བའི་ཆར་མངོན་པར་ཕབ་སྟེ།
en: Ten thousand Suyāma deva kings were also in the sky with an entourage of deva youths and apsarases, all of whom were sending down a rain of divine coral tree flowers.

source: འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། བདག་ཅག་ཀྱང་ལྷ་རྫས་ཀྱི་གླུ་སྙན་པ་ལ་དགའ་བ་མེད་དེ།
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats, we ceased to take delight in listening to divine songs.

source: དེ་ལྟར་དགའ་བ་མེད་པས་འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་སྟེ།
en: As we had ceased to take delight in them, we came into the presence of this ārya.

source: བདག་ཅག་ཕྱིན་ནས་ཀྱང་། འཕགས་པ་འདི་ནི་འདོད་པའི་དགའ་བ་ཐམས་ཅད་རྣམ་པར་བཟློག་པར་བྱ་བ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: When we came into his presence, he taught us the Dharma so that we would turn away from all delight in desires and so that we would attain all of the Buddhadharma.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སྟོང་ཕྲག་བཅུ་སོ་སོ་ནས། ཉེ་བའི་དབང་པོ་སུམ་ཅུ་རྩ་གཉིས་དང་། ལྷའི་བུ་དང་། ལྷའི་བུ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པས།
en: Ten thousand Śakras, lords of devas, each with their thirty-two secondary lords and an entourage of deva youths and apsarases, were also in the sky.

source: ལྷ་རྫས་ཀྱི་གོས་དང་། རིན་པོ་ཆེའི་རྒྱན་དང་། མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་སྟེ། འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི།
en: They were dropping down rain from clouds of divine clothing, precious adornments, and flowers.

source: དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། བདག་ཅག་ཀྱང་བརྒྱ་བྱིན་གྱི་ཁང་པ་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། རྩེ་བའི་ནགས་ཚལ་དང་། ལྷ་རྫས་ཀྱི་རོལ་མོ་བརྡུང་ཞིང་དཀྲོལ་བ་དང་།
en: They said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, we ceased to take delight in Śakra’s palace, park, pleasure groves, the playing of divine music, attendants, and songs.

source: གམ་ཡོ་ན་གླུ་ལེན་པའི་ལོངས་སྤྱོད་ལ་དགའ་བ་མེད་དེ། དེ་ལྟར་བདག་ཅག་དགའ་བ་མེད་པས་འདིའི་དྲུང་དུ་འདོང་ངོ་། །
en: As we had ceased to take delight in them, we came into the presence of this ārya.

source: བདག་ཅག་དེར་ཕྱིན་ནས་ཀྱང་འཕགས་པ་འདི་ནི་ཁོ་བོ་ཅག་ལ་འདོད་པའི་དགའ་བ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: When we came into his presence, he taught us the Dharma so that we would renounce all delight in desires.

source: འདི་དག་ཐམས་ཅད་ནི་རྟག་པ་མ་ཡིན་ཏེ། མི་བརྟན་ཞིང་འཇིག་པར་འགྱུར་བའི་ཆོས་ཅན་ནོ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་དོ། །དྲེགས་པ་དང་བག་མེད་པ་ཐམས་ཅད་ཡོངས་སུ་གཅད་པ་དང་།
en: He said, ‘All these have the qualities of being impermanent, unstable, and decaying.’

source: བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སྤྲོ་བ་བསྐྱེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: He taught us the Dharma so that our arrogance and carelessness would end and we would develop the aspiration for the highest enlightenment.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་འདིས་བལྟས་པ་ཙམ་གྱིས་རི་རབ་ཀྱི་རྩེ་མོ་ཐམས་ཅད་ཀྱང་གཡོ་བར་འགྱུར་ཏེ།
en: “Moreover, noble one, just by his gaze these peaks of Meru are shaken.

source: དེས་བདག་ཅག་གཤིགས་པས་སེམས་སྐྱོ་བར་གྱུར་ནས། ཐམས་ཅད་མཁྱེན་པའི་སེམས་བརྟན་པས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ། །
en: We became alarmed on being shaken, and as the omniscient mind cannot be disturbed, we made the prayer to attain omniscient wisdom.”

source: ཀླུའི་རྒྱལ་པོ་ཤུགས་ལྡན་དང་། དགའ་བོ་དང་། བསྙེན་དགའ་བོ་ལ་སྩོགས་པ། ཀླུ་བརྒྱ་སྟོང་ཕྲག་བཅུ་དག་ཀྱང་སྟེང་གི་བར་སྣང་ལ་གནས་ཤིང་དུས་དང་མཐུན་པའི་ལྷ་རྫས་ཀྱི་ཙན་དན་གྱི་སྤྲིན་དང་།
en: Ten thousand nāgas such as the nāga kings Airāvata, Nanda, and Upananda were also in the sky above.

source: ཀླུའི་བུ་མོས་གླུ་བླངས་པའི་ང་རོ་སྙན་པའི་དབྱངས་དང་། ལྷ་རྫས་ཀྱི་སྤོས་ཆུའི་རྒྱུན་རབ་ཏུ་འབབ་པའི་ཆར་མངོན་པར་ཕབ་སྟེ། འདི་སྐད་ཅེས་འཛེར་ཏོ། །
en: They were sending down rain from clouds of divine yellow sandalwood, the pleasant sound of a chorus of nāga maidens, and rain that was a flow of divine scented water.

source: རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་ཆེན་པོ་འདི་ལས་འོད་ཆེན་པོ་བྱུང་སྟེ། དེས་ཀླུའི་གནས་ཐམས་ཅད་སྣང་བར་བྱས་ནས། བྱེ་མའི་ཆར་དང་། ནམ་མཁའ་ལྡིང་གི་འཇིགས་པ་ཡོངས་སུ་སེལ་ཏོ། །
en: They said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, from this great fire shone a great light that illuminated all the dwellings of nāgas and eliminated the rains of sand and fear of the garuḍas.

source: ཁྲོ་བ་འབྱུང་བ་ཡང་ཞི་བར་བྱས་ཏེ། ལུས་སིམ་པར་བྱས་ནས་ཡིད་ཤིན་ཏུ་མོས་པར་བྱེད་དོ། །དེ་ལྟར་སེམས་ཤིན་ཏུ་མོས་པར་གྱུར་ནས།
en: It also pacified anger, refreshed our bodies, and made our minds serene.

source: འཕགས་པ་འདི་ནི་བདག་ཅག་ལ་ཆོས་སྟོན་ཏེ། འདི་ལྟར་ཀླུའི་ལམ་གྱི་རྒྱུད་ངན་པ་རྣམ་པར་སྨད་པ་དང་། སྒྲིབ་པའི་ལས་ཐམས་ཅད་རབ་ཏུ་སྤང་བའི་ཕྱིར་ཉེས་པ་འཆགས་སུ་བཙུད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཙུད་དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རབ་ཏུ་དགོད་དོ། །
en: Then when we had serene minds, this ārya taught us the Dharma so that we would repudiate the evil ways of nāgas, renounce all karma that brings obscuration, confess transgressions, develop the aspiration for the highest, complete enlightenment, and be established in omniscience.”

source: གནོད་སྦྱིན་གྱི་དབང་པོ་སྟོང་ཕྲག་བཅུ་ཡང་ནམ་མཁའི་དབྱིངས་ལ་འཁོད་དེ།
en: Ten thousand yakṣa lords were also in the sky above.

source: མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་དང་། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་མཆོད་པ་བྱས་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། ཁོ་བོ་ཅག་གི་འཁོར་ཀུན་ཀྱང་མི་རྣམས་ལ་བྱམས་པའི་སེམས་སྐྱེ་བར་འགྱུར་ཏེ།
en: They made various kinds of offerings to the brahmin Jayoṣmāyatana and Sudhana, the head merchant’s son, and then they said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, we and all our retinues developed a loving mind toward humans.

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། གྲུལ་བུམ་ཐམས་ཅད་ཀྱང་བྱམས་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏོ། །
en: All yakṣas, rākṣasas, and kumbhāṇḍas also developed loving minds.

source: དེ་དག་བྱམས་པའི་སེམས་དང་ལྡན་ཞིང་འཚེ་བ་མེད་པ་ལ་ཞུགས་པ་རྣམས་ཁོ་བོ་ཅག་གི་དྲུང་དུ་འོང་ངོ་། །
en: They came before us with loving minds and without violence.

source: ཁོ་བོ་ཅག་ཀྱང་དེ་ལྟར་བྱམས་པའི་དབང་གི་ཟིལ་གྱིས་ནོན་པས། རང་རང་གི་གནས་དེ་དང་། དེ་དག་ན་དགའ་བ་མེད་དེ།
en: We too were overpowered by the power of love, and each of us ceased to delight in our own residences.

source: དེ་ལྟར་བདག་ཅག་ཀྱང་རང་རང་གི་སྐྱེ་བོའི་འཁོར་དང་བཅས་ཏེ། འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །
en: In that way, we each went with our retinues to the presence of the ārya.

source: འཕགས་པ་བདག་ཅག་དེ་ལྟར་འོངས་པ་རྣམས་ལ་འཕགས་པ་འདིའི་སྐུ་ལས་བྱུང་བའི་འོད་ཀྱིས་ལུས་ཐམས་ཅད་སྣང་བར་བྱས་ཤིང་། བདེ་བས་ཁྱབ་པར་མཛད་དེ།
en: When we arrived, a light came from this ārya’s body, illuminated all our bodies, and filled us with bliss.

source: དེ་ལྟར་བདག་ཅག་ལུས་དང་སེམས་བདེ་བར་གྱུར་ནས།
en: In that way, both our bodies and minds became blissful.

source: འཕགས་པ་འདི་ནི་ཅི་ནས་ཀྱང་བདག་ཅག་ལ་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་གྲུལ་བུམ་དང་། ལུས་སྲུལ་པོ་མང་པོ་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ། །
en: Then he taught us the Dharma so that the multitude of yakṣas, rākṣasas, kumbhāṇḍas, and kaṭapūtanas would develop the aspiration to enlightenment.”

source: དྲི་ཟའི་དབང་པོ་སྟོང་ཕྲག་བཅུ་དག་ཀྱང་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ཅག་ཀྱང་རང་རང་གི་གནས་ན་འཁོད་པའི་ཚེ། འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་འདི་ལས་འོད་བྱུང་སྟེ། བདག་ཅག་གི་གནས་སྣང་བར་གྱུར་ཏོ། །
en: Ten thousand gandharva lords were also in the sky above, and they said, “Noble one, while we were each dwelling in our own abodes, and when this ārya was enduring the ascetic practice of the five heats, from this fire came a light that illuminated our abodes.

source: དེ་ལྟར་བདག་ཅག་འོད་དེས་ཕོག་སྟེ། བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་གྱུར་པས།
en: When that light struck us we experienced inconceivable bliss.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་སྟེ། བདག་ཅག་དྲུང་དུ་ཕྱིན་ནས་ཀྱང་འཕགས་པ་འདི་ནི་བདག་ཅག་ཅི་ནས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: We went to be in the presence of this ārya, and when we arrived in his presence, he taught us the Dharma so that we would progress irreversibly toward the highest, complete enlightenment.”

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྟོང་ཕྲག་བཅུ་དག་ཀྱང་རྒྱ་མཚོའི་ནང་ནས་མངོན་པར་འཐོན་ཏེ། ནམ་མཁའ་ལ་པུས་མོ་གཡས་པའི་ལྷ་ང་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་ཞིང་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། ཁོ་བོ་ཅག་གི་ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་རྒྱ་མཚོ་དང་རིར་བཅས་པའི་ས་ཆེན་པོའི་དཀྱིལ་འཁོར་རབ་ཏུ་གཡོ་བར་གྱུར་ཏེ།
en: Ten thousand asura lords rose up from the ocean, high into the sky, where they knelt on their right knees, and with hands together in homage they paid homage, saying, “Noble one, when this ārya was enduring the ascetic practice of the five heats, our asura world, a great circle of earth with its oceans and mountains, shook.

source: བདག་ཅག་ཀུན་གྱི་ང་རྒྱལ་དང་རློམ་སེམས་དང་། དྲེགས་པ་ཐམས་ཅད་བརྟུལ་ཤུགས་དང་། དཀའ་ཐུབ་ཀྱི་ཟིལ་གྱིས་ནོན་ཏེ།
en: All our arrogance and pride was overwhelmed by his self-discipline and asceticism.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །དེར་ཕྱིན་ནས་ཀྱང་འཕགས་པ་འདི་ནི་བདག་ཅག་ལ་གཡོ་སྒྱུ་ཐམས་ཅད་རབ་ཏུ་སྤང་བ་དང་། ཆོས་ཟབ་མོའི་བཟོད་པ་ལ་གཟུད་པ་དང་། མི་གཡོ་བའི་ཆོས་ཉིད་ལ་རབ་ཏུ་དགོད་པ་དང་། སྟོབས་བཅུའི་ཡེ་ཤེས་ཡོངས་སུ་གྲུབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: We went to be in the presence of this ārya, and when we arrived in his presence, he taught us the Dharma so that we would abandon all deception, enter the patience of the profound Dharma, be established in the unshakable true nature of phenomena, and attain the knowledge of the ten strengths.”

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཤུགས་ཆེན་པོ་འཛིན་པ་ལ་སྩོགས་པ་ནམ་མཁའ་ལྡིང་གི་དབང་པོ་སྟོང་ཕྲག་བཅུས་ཀྱང་བྲམ་ཟེའི་བུ་ཤིན་ཏུ་སྡུག་གུའི་གཟུགས་སུ་མངོན་པར་སྤྲུལ་ཏེ། འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་འདི་དག་ལས་འོད་ཆེན་པོ་བྱུང་སྟེ། བདག་ཅག་གི་གནས་སྣང་བར་བྱས་ནས།
en: Ten thousand garuḍa lords such as the garuḍa lord Mahāvegadhārin manifested in the form of handsome brahmin youths and said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, a great light came from these great masses of fire and illuminated and shook our abodes.

source: ཡོངས་སུ་གཡོ་བར་བྱེད་དོ། །དེས་བདག་ཅག་ཀྱང་འཇིགས་ཤིང་སྐྲག་སྟེ། སྐྱོ་བའི་ཡིད་དང་ལྡན་པར་གྱུར་ནས་འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །
en: We were frightened, terrified, and dismayed, and so we went to be in the presence of this ārya.

source: འཕགས་པ་འདི་ཡང་བདག་ཅག་ལ་ཆོས་སྟོན་ཅིང་། བྱམས་པ་ཆེན་པོ་ལ་ཡང་དག་པར་སྦྱོར་བ་མཛད་དོ། །སྙིང་རྗེ་ཆེན་པོ་ལ་ཡང་དག་པར་དགོད་པ་མཛད་དོ། །འཁོར་བའི་རྒྱ་མཚོར་འཇུག་པ་ལ་ཡང་ཡང་དག་པར་སྦྱོར་བ་མཛད་དོ། །འདོད་པའི་འདམ་དུ་བྱིང་བའི་སེམས་ཅན་མངོན་པར་གདོན་པར་བྱ་བ་ལའང་ཡོངས་སུ་སྦྱོར་བ་མཛད་དོ། །ལྷག་པའི་བསམ་པའི་སྒོ་རྣམ་པར་དག་པར་བྱ་བ་ལའང་རབ་ཏུ་སྦྱོར་བ་མཛད་དོ། །ཤེས་རབ་དང་ཐབས་ཤིན་ཏུ་གསལ་བ་ལའང་ཡང་དག་པར་སྦྱོར་བ་མཛད་དོ། །རྣམ་པ་ཇི་ལྟ་བུར་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་སེམས་ཅན་རྣམས་གདུལ་བར་བྱ་བ་ལའང་རབ་ཏུ་སྦྱོར་བ་མཛད་དོ། །
en: This ārya taught us the Dharma so that we would practice great love, so that we were established in great compassion, so that we would apply ourselves to plunging into the ocean of saṃsāra, so that we would apply ourselves to saving beings who are sinking in the swamp of desire, so that we would apply ourselves to the pure gateway of the higher motivation for enlightenment, so that we would apply ourselves to sharp wisdom and methods, and so that we would apply ourselves to guiding beings in whatever way will ripen them.”

source: མིའམ་ཅིའི་དབང་པོ་སྟོང་ཕྲག་བཅུ་ཡང་སྟེང་གི་བར་སྣང་ལ་འཁོད་དེ་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ།
en: Ten thousand kinnara lords were also in the sky.

source: ཁོ་བོ་ཅག་གི་གནས་ན་འཁོད་པའི་ཤིང་ཏ་ལའི་ཕྲེང་བ་ལས་དྲིལ་བུའི་དྲ་བ་རིན་པོ་ཆེའི་སྲད་བུས་ལྡ་ལྡིར་བརྒྱུས་པའི་སིལ་སྙན་དང་། རོལ་མོའི་ཡོ་བྱད་དང་། རིན་པོ་ཆེའི་རྒྱན་དང་། ཁྱིམ་གྱི་ལོངས་སྤྱོད་ཐམས་ཅད་ལས་སངས་རྒྱས་ཀྱི་སྒྲ་བྱུང་ངོ་། །ཆོས་ཀྱི་སྒྲ་དང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱི་སྒྲ་དང་། བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པའི་སྨོན་ལམ་གྱི་སྒྲ་བྱུང་ངོ་། །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་སོ། །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའི་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་དཀའ་བ་ཡོངས་སུ་གཏོང་བ་བྱེད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་སྦྱོང་བ་བྱེད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་སྙིང་པོ་བྱང་ཆུབ་ཏུ་འགྲོའོ། །
en: They said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, the sound of the word Buddha, the word Dharma, the words irreversible bodhisattva Saṅgha, and the words the prayer to reach enlightenment came from the rows of palm trees, the music of the garlands of strings of networks of little bells on our trees, the musical instruments, the precious jewelry, the enjoyed possessions in the homes, and the blowing of the breezes in our domain.
